<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple/DTD PLIST 1.0//EN" "http://apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
  <dict>
    <key>Attribution</key>
    <dict>
      <key>Copyright</key>
      <string>University of Oxford 2016</string>
      <key>Author</key>
      <dict>
        <key>Name</key>
        <string>Christopher Beard</string>
        <key>Email</key>
        <string>christopher.beard@it.ox.ac.uk</string>
        <key>Github</key>
        <string>cdbeard</string>
      </dict>
    </dict>
    <key>Description</key>
    <string>Packages contents of 'Payload' dir and imports into munki.</string>
    <key>Identifier</key>
    <string>uk.ac.ox.orchard.munki.Orchard_Branding</string>
    <key>Input</key>
    <dict>
      <key>NAME</key>
      <string>Orchard_Branding</string>
      <key>MUNKI_REPO_SUBDIR</key>
      <string>%NAME%</string>
      <key>pkginfo</key>
      <dict>
        <key>catalogs</key>
        <array>
          <string>unstable</string>
        </array>
        <key>category</key>
        <string>System Software</string>
        <key>description</key>
        <string>Deploys Orchard branding files (desktops, user pictures, login icons) to /Library/Orchard.</string>
        <key>developer</key>
        <string>Oxford University</string>
        <key>display_name</key>
        <string>Orchard Branding</string>
        <key>postuninstall_script</key>
        <string>#!/bin/bash
#
# Undoes the changes made by script payload/usr/local/boot-once/setDefaultDesktopPicture.sh
# For inclusion in pkginfo postuninstall_script key of Orchard_Branding package.
#
# Copyright (C) 2017 Oxford University
#    Christopher Beard christopher.beard(at)it.ox.ac.uk>
#
# This program is free software; you can redistribute
# it and/or modify it under the terms of the GNU
# General Public License version 3 as published by
# the Free Software Foundation.
#
################################################################################!/bin/bash

OS_DESKTOPS='/Library/Desktop Pictures'
OS_VERSION=$(sw_vers -productVersion | /usr/bin/awk -F'.' '{ print $2 }') || { echo "Could not extract OS version."; exit 1; }

function restoreDefaultDesktop {
  local OS_DEFAULT=$1

  # Stop if the default file is not a symlink
  [ ! -h "${OS_DESKTOPS}/${OS_DEFAULT}" ] &amp;&amp; { echo "ERROR: Default desktop file '${OS_DESKTOPS}/${OS_DEFAULT}' is not a symlink, exiting."; exit 1; }

  echo "Removing symlink '${OS_DESKTOPS}/${OS_DEFAULT}' to '${ORCHARD_DESKTOP}'"
  rm "${OS_DESKTOPS}/${OS_DEFAULT}"

  echo "Renaming 'Default - ${OS_DEFAULT}' back to ${OS_DESKTOPS}/${OS_DEFAULT}"
  mv "${OS_DESKTOPS}/Default - ${OS_DEFAULT}" "${OS_DESKTOPS}/${OS_DEFAULT}"
}

case $OS_VERSION in
  10)
    echo "OS X 10.10 detected."
    restoreDefaultDesktop 'Yosemite.jpg'
    ;;
  11)
    echo "OS X 10.11 detected."
    restoreDefaultDesktop 'El Capitan.jpg'
    ;;
  12)
    echo "macOS 10.12 detected."
    restoreDefaultDesktop 'Sierra.jpg'
    ;;
  *)
    echo "ERROR: Unsupported macOS version."
    exit 1
    ;;
esac</string>
        <key>name</key>
        <string>%NAME%</string>
        <key>unattended_install</key>
        <true/>
      </dict>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.0</string>
    <key>ParentRecipe</key>
    <string>uk.ac.ox.orchard.pkg.Orchard_Branding</string>
    <key>Process</key>
    <array>
      <!-- Import to munki repo -->
      <dict>
        <key>Processor</key>
        <string>MunkiImporter</string>
        <key>Arguments</key>
        <dict>
          <key>pkg_path</key>
          <string>%pkg_path%</string>
          <key>repo_subdirectory</key>
          <string>%MUNKI_REPO_SUBDIR%</string>
        </dict>
      </dict>
    </array>
    <key>requires</key>
    <array>
      <string>outset</string>
    </array>
  </dict>
</plist>
