<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple/DTD PLIST 1.0//EN" "http://apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
  <dict>
    <key>Description</key>
    <string>Creates a pkg with Oxford Branding resources</string>
    <key>Identifier</key>
    <string>uk.ac.ox.orchard.pkg.Orchard_Branding</string>
    <key>Input</key>
    <dict>
      <key>NAME</key>
      <string>Orchard_Branding</string>
      <key>VERSION</key>
      <string>20161109</string>
      <key>PKG_ID</key>
      <string>uk.ac.ox.orchard.pkg.OrchardBranding</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.0</string>
    <key>Process</key>
    <array>
      <dict>
        <key>Processor</key>
        <string>PkgCreator</string>
        <key>Arguments</key>
        <dict>
          <key>pkg_request</key>
          <dict>
            <key>pkgroot</key>
            <string>%RECIPE_DIR%/payload</string>
            <key>pkgdir</key>
            <string>%RECIPE_DIR%/build</string>
            <key>pkgname</key>
            <string>%NAME%-%VERSION%</string>
            <key>id</key>
            <string>%PKG_ID%</string>
            <key>version</key>
            <string>%VERSION%</string>
            <key>options</key>
            <string>purge_ds_store</string>
            <key>chown</key>
            <array>
              <dict>
                <key>path</key>
                <string>Library</string>
                <key>user</key>
                <string>root</string>
                <key>group</key>
                <string>wheel</string>
                <key>mode</key>
                <string>0755</string>
              </dict>
              <dict>
                <key>path</key>
                <string>Library/Orchard/Artwork/Desktop_Pictures</string>
                <key>user</key>
                <string>root</string>
                <key>group</key>
                <string>wheel</string>
                <key>mode</key>
                <string>0644</string>
              </dict>
              <dict>
                <key>path</key>
                <string>Library/Orchard/Artwork/User_Pictures</string>
                <key>user</key>
                <string>root</string>
                <key>group</key>
                <string>wheel</string>
                <key>mode</key>
                <string>0644</string>
              </dict>
              <dict>
                <key>path</key>
                <string>/usr</string>
                <key>user</key>
                <string>root</string>
                <key>group</key>
                <string>wheel</string>
                <key>mode</key>
                <string>0755</string>
              </dict>
            </array>
          </dict>
        </dict>
      </dict>
    </array>
  </dict>
</plist>
