<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple/DTD PLIST 1.0//EN" "http://apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
  <dict>
    <key>Attribution</key>
    <dict>
      <key>Copyright</key>
      <string>University of Oxford 2016</string>
      <key>Author</key>
      <dict>
        <key>Name</key>
        <string>Christopher Beard</string>
        <key>Email</key>
        <string>christopher.beard at it.ox.ac.uk</string>
        <key>Github</key>
        <string>cdbeard</string>
      </dict>
    </dict>
    <key>Description</key>
    <string>Packages a selection of freeware/free licensed fonts and imports into munki.</string>
    <key>Identifier</key>
    <string>uk.ac.ox.orchard.munki.Fonts_Freefonts</string>
    <key>Input</key>
    <dict>
      <key>NAME</key>
      <string>Fonts_Freefonts</string>
      <key>MUNKI_REPO_SUBDIR</key>
      <string>%NAME%</string>
      <key>pkginfo</key>
      <dict>
        <key>catalogs</key>
        <array>
          <string>unstable</string>
        </array>
        <key>category</key>
        <string>System Software</string>
        <key>description</key>
        <string>A selection of freeware/free licensed fonts.</string>
        <key>developer</key>
        <string>Oxford University</string>
        <key>display_name</key>
        <string>Fonts Freefonts</string>
        <key>icon_name</key>
        <string>Fonts.png</string>
        <key>name</key>
        <string>%NAME%</string>
        <key>postinstall_script</key>
        <string>#!/bin/sh
rm -rf /Library/Fonts/MMP-Freefonts
        </string>
        <key>unattended_install</key>
        <true/>
      </dict>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.0</string>
    <key>ParentRecipe</key>
    <string>uk.ac.ox.orchard.pkg.Fonts_Freefonts</string>
    <key>Process</key>
    <array>
      <!-- Import to munki repo -->
      <dict>
        <key>Processor</key>
        <string>MunkiImporter</string>
        <key>Arguments</key>
        <dict>
          <key>pkg_path</key>
          <string>%pkg_path%</string>
          <key>repo_subdirectory</key>
          <string>%MUNKI_REPO_SUBDIR%</string>
        </dict>
      </dict>
    </array>
  </dict>
</plist>
